{
  "utils": {
    "pageNotFound": "Erreur la page demandé n'est pas trouvable"
  },
  "header": {
    "home": "Acceuil",
    "intro": "Introduction",
    "project": "Projets",
    "progress": "Progrès",
    "contact": "Contacter"
  },
  "footer": {
    "title": "Site web Bootstrap",
    "desc": "Styles css et certaines fonctionnalités",
    "copyright": "© Copyright 2022 - Made by LP-F"
  },
  "projects": {
    "architect": {
      "title": "Architect Cloud",
      "description": "Ceci est ma première page web commencé de rien du tout. Elle est faite en HTML et CSS pure."
    },
    "games": {
      "title": "Portail de jeux",
      "description": "Ceci est une page web fait lors de la 2e session mettant en place un système simple de connexion, un catalogue de jeux et un jeux codé par nous même."
    },
    "d&d": {
      "title": "Dungeon & Dragon",
      "description": "Ceci est une page web affichant différent personnage de dungeon et dragon. Malheureusement, l'API est fermé par notre professeur pour le moment."
    }
  },
  "pages": {
    "common": {
      "login": "Se connecter",
      "signUp": "S'inscrire",
      "logout": "Se déconnecter",
      "cancel": "Annuler",
      "confirm": "Confirmer",
      "confirmPassword": "Confirmer le mot de passe",
      "username": "Nom d'utilisateur",
      "email": "Courriel",
      "enterEmail": "Entrer votre courriel",
      "password": "Mot de passe",
      "forgotPassword": "Mot de passe oublié?",
      "enterUsername": "Entrer votre nom d'utilisateur"
    },
    "home": {
      "title": "Technique De L'Informatique",
      "description": "Cette page est présentée par Louis-Philippe Forget, étudiant en technique de l'informatique au Cégep André-Laurendeau. Vous y trouverez des informations sur moi, mes projets et mes progrès en langage de programmation.",
      "intro": "Introduction",
      "me": "Moi",
      "desc": "Je suis Louis-Philippe étudiant en technique de l'informatique au cégep André-Laurendeau",
      "aptitudes": "Aptitudes",
      "aptitudesDesc": "Je suis un programmeur qui aime apprendre de nouvelles choses et qui est capable de s'adapter à de nouvelles situations. Je suis aussi capable de travailler en équipe et de m'adapter à de nouvelles situations.",
      "developpement": "Développement",
      "developpementDesc": "Ceci est une page web personnel. Plusieurs projets y seront rattachés dont le dernier que j'ai fait. Celui-ci est une page de D&D qui utilise différents API pour charger les personnages d'une partie.",
      "design": "Design",
      "designDesc": "Cette page utilise les designs de Bootstrap v5. Je ne suis bien évidemment pas le meilleur en design :) ",
      "commands": "Commandes & Requêtes",
      "commandsDesc": "Dans le programme 420.0B nous utilisons différents systèmes d'exploitation et différentes méthodes pour stocker des données ce qui nous oblige à apprendre les lignes de commande et les requêtes.",
      "projects": "Mes projets",
      "projectSecond": "J'ai eu la chance de faire plusieurs projets en programmation web.",
      "projectsDesc": "Les différents sites sont ici pour voir mon évolution de la première session à la 3e session. Malheureusement, certains sites ne sont pas totalement complétés par la transcription de JavaScript à TypeScript. Aussi, l'API du site de Dungeon & Dragon est fermée par notre professeur ce qui lui donne une allure bien moins justifiée pour le moment.",
      "goToProjects": "Aller aux projets",
      "progress": "Progrès",
      "progressDesc": "Cette page est faite pour montrer mon évolution en programmation web. Vous y trouverez des informations sur les différents langages que j'ai appris et les différents projets que j'ai fait.",
      "contact": "Nous Contacter",
      "question": "Si vous avez des questions, n'hésitez pas à nous contacter.",
      "name": "Nom complet",
      "email": "Courriel",
      "number": "Numéro de téléphone",
      "message": "Message",
      "send": "Envoyer",
      "sent": "Message envoyé"
    }
  },
  "errors": {
    "password": "Le mot de passe doit contenir au moins 5 caractères, une majuscule, une minuscule et un chiffre.",
    "passwords": "Les mots de passe ne sont pas identiques.",
    "username": "Le nom d'utilisateur doit contenir au moins 4 caractères.",
    "email": "Le courriel est invalide."
  },
  "toast": {
    "error": {
      "password": "Mot de passe valide",
      "passwords": "Les mots de passe ne sont pas identiques",
      "username": "Nom d'utilisateur valide",
      "email": "Courriel valide",
      "invalid": "Nom d'utilisateur ou mot de passe invalide"
    },
    "info": {
      "logout": "Vous êtes déconnecté",
      "login": "Vous êtes connecté",
      "notLogged": "Vous devez vous connecter avant de procéder"
    }
  }
}